In [1]:
%load_ext sql

In [2]:
import json
with open('/home/shadowleaf/.local/config/mysql_config.json') as f:
  data = json.load(f)

In [3]:
import os
DATABASE_URL = 'mysql+pymysql://{}:{}@localhost:3306/students'.format(data['user'], data['password'])
os.environ['DATABASE_URL'] = DATABASE_URL

## Show the databases

In [4]:
%sql SHOW DATABASES

5 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('students',),
 ('sys',)]

## Select a Database

In [5]:
%sql USE students;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
0 rows affected.

[]

## Show Tables

In [6]:
%sql SHOW TABLES

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.

[('student_list',)]

## Create a Table and Insert Data into it

In [7]:
%%sql

-- if the table already exists then drop it

DROP TABLE IF EXISTS `student_list`;

-- create a table with the attributes

CREATE TABLE `student_list` (
  `student_id` int(11) DEFAULT NULL,
  `student_name` char(20) DEFAULT NULL,
  `student_address` char(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- insert data into the table

LOCK TABLES `student_list` WRITE;
INSERT INTO `student_list` VALUES (101,'satyajit ghana','bangalore'),(102,'shikhar singh','bangalore'),(103,'shubham agarwal','haryana'),(104,'pritam das','kolkata');
UNLOCK TABLES;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
0 rows affected.
0 rows affected.
0 rows affected.
4 rows affected.
0 rows affected.

[]

## Describe Table

In [8]:
%sql DESC `student_list`

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
3 rows affected.

[('student_id', 'int(11)', 'YES', '', None, ''),
 ('student_name', 'char(20)', 'YES', '', None, ''),
 ('student_address', 'char(50)', 'YES', '', None, '')]

## View the Data stored in Table

In [9]:
%sql SELECT * FROM student_list;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
4 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana'),
 (104, 'pritam das', 'kolkata')]

## Update a row in the table

UPDATE statement that changes the data of one or more records in a table. It is used to update a row of a table. Either all the rows can be updated, or a subset may be chosen using a condition.

In [10]:
%%sql

UPDATE `student_list` SET student_id=105 WHERE student_id=104;

SELECT * FROM `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.
4 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana'),
 (105, 'pritam das', 'kolkata')]

In [11]:
%%sql

DELETE FROM `student_list` WHERE student_id=105;

SELECT * FROM `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.
3 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana')]

## Aggregate Functions

In [12]:
%sql SELECT COUNT(*), AVG(student_id), SUM(student_id), MIN(student_id), MAX(student_id)  FROM `student_list`

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.

[(3, Decimal('102.0000'), Decimal('306'), 101, 103)]

# Lab01

    1. Display the details of all the students

In [13]:
%sql SELECT * FROM `student_list`

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
3 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana')]

    2. Display the name and address of the student with id = 101

In [14]:
%sql SELECT student_name, student_address FROM `student_list`

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
3 rows affected.

[('satyajit ghana', 'bangalore'),
 ('shikhar singh', 'bangalore'),
 ('shubham agarwal', 'haryana')]

    3. Insert a new student <105, ‘John’, ‘Bangalore’>

In [15]:
%%sql

INSERT INTO student_list VALUES(105, 'John', 'Bangalore');

SELECT * FROM `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.
4 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana'),
 (105, 'John', 'Bangalore')]

    4. Change the address of the student John to ‘Delhi’

In [16]:
%%sql

UPDATE `student_list` SET student_address='Delhi' WHERE student_id=105;

SELECT * FROM `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.
4 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana'),
 (105, 'John', 'Delhi')]

    5. Delete the details of a student with student id=105

In [17]:
%%sql

DELETE FROM `student_list` WHERE student_id=105;

SELECT * FROM `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
1 rows affected.
3 rows affected.

[(101, 'satyajit ghana', 'bangalore'),
 (102, 'shikhar singh', 'bangalore'),
 (103, 'shubham agarwal', 'haryana')]

    6. Add a column to the schema Student with appropriate data type

In [18]:
%%sql

ALTER TABLE `student_list` ADD marks int(11);

DESC `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
0 rows affected.
4 rows affected.

[('student_id', 'int(11)', 'YES', '', None, ''),
 ('student_name', 'char(20)', 'YES', '', None, ''),
 ('student_address', 'char(50)', 'YES', '', None, ''),
 ('marks', 'int(11)', 'YES', '', None, '')]

In [19]:
%sql SELECT * FROM `student_list`;

 * mysql+pymysql://shadowleaf:***@localhost:3306/students
3 rows affected.

[(101, 'satyajit ghana', 'bangalore', None),
 (102, 'shikhar singh', 'bangalore', None),
 (103, 'shubham agarwal', 'haryana', None)]